public class Main {
    public static void main(String[] args) {
        //now i am comeback
        //in SQL we have 2 parts :
        //1. DDL(Data Definition Language)
        //2. DMl(Data Manipulation Language)
//                      +----------------------------------+
//                      |   SQL (Structured Query Language)|
//                      +----------------------------------+
//                                /                   \
//                               /                     \
//                +--------------------------------+    +------------------------------------------+
//                | DDL (Data Definition Language) |    | DML (Data Manipulation Language)         |
//                +--------------------------------+    +------------------------------------------+
//                       |          |        |                   |        |           |          |
//                       |          |        |                   |        |           |          |
//                +---------+  +---------+  +---------+     +---------+ +---------+ +---------+ +---------+
//                | CREATE  |  |  DROP   |  | ALTER   |     | INSERT  | | DELETE  | | UPDATE  | | SELECT  |
//                +---------+  +---------+  +---------+     +---------+ +---------+ +---------+ +---------+
//                              удалить      изменить        добавление   удаление   обновление  выборка данных
//                                                          новый строк                          (используется чаще всего)

    }
}